In [2]:
import pandas as pd 
df=pd.read_excel(r"C:\Users\lzhen\Downloads\Data+Science+in+Python+-+Data+Prep+&+EDA\Data\Student Grades.xlsx")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [3]:
df['Class'].value_counts(dropna=False)

Class
Intro to Python              25
Intro to SQL                 20
EDA                          13
Exploratory Data Analysis    12
Freshman Seminar             12
NaN                           3
Python                        1
Name: count, dtype: int64

In [4]:
df[df.Grade>100]

   Student                      Class       Year  Grade
60    Ella  Exploratory Data Analysis  Sophomore  200.0

In [5]:
import numpy as np 
df.Class=np.where(df.Class=='EDA', 'Exploratory Data Analysis', df.Class)
df.Class=np.where(df.Class=='Python', 'Intro to Python', df.Class)
#df.Class.value_counts(dropna=False)
df.Class.value_counts()

Class
Intro to Python              26
Exploratory Data Analysis    25
Intro to SQL                 20
Freshman Seminar             12
Name: count, dtype: int64

In [6]:
df.Grade=np.where(df['Grade']>100, 100, df['Grade'])
df.Grade.describe()

count     82.000000
mean      84.487805
std        8.991414
min       45.000000
25%       81.000000
50%       85.000000
75%       90.000000
max      100.000000
Name: Grade, dtype: float64

In [7]:
import pandas as pd 
df_grades=pd.read_excel(r"C:\Users\lzhen\Downloads\Data+Science+in+Python+-+Data+Prep+&+EDA\Data\Student Grades.xlsx")
grade_maping={'EDA':'Exploratory Data Analysis', 'Python':'Intro to Python','Exploratory Data Analysis':'Exploratory Data Analysis',
              'Intro to Python':'Intro to Python','Freshman Seminar':'Freshman Seminar','Intro to SQL':'Intro to SQL'}
df_grades.Class=df_grades.Class.map(grade_maping)
df_grades.Class.value_counts(dropna=False)

Class
Intro to Python              26
Exploratory Data Analysis    25
Intro to SQL                 20
Freshman Seminar             12
NaN                           3
Name: count, dtype: int64

In [8]:
#---------------------------Duplicate------------------------#
import pandas as pd 
df1=pd.read_excel(r"C:\Users\lzhen\Downloads\Data+Science+in+Python+-+Data+Prep+&+EDA\Data\Student Grades.xlsx")
df1=df1.drop_duplicates().reset_index(drop=True)
df1.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [13]:
min_grade=df[df['Grade']>=60].Grade.min()
df['Grade']=np.where(df['Grade']<60, min_grade, df.Grade)
df.Grade.describe()

count     82.000000
mean      84.890244
std        7.557199
min       64.000000
25%       81.000000
50%       85.000000
75%       90.000000
max      100.000000
Name: Grade, dtype: float64